import matplotlib.pyplot as plt
import pandas as pd
# 设置图片清晰度
plt.rcParams['figure.dpi'] = 300
plt.rcParams['font.sans-serif'] = ['simhei']
# 提取杭州、宁波、温州三个城市 2008 - 2023 年的就业人员数数据
data = pd.DataFrame({
    '年份': [2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023],
    '杭州市': [564.74, 578.08, 591.9, 599.03, 600.97, 606.89, 613.64, 627.7, 641.45, 658.37, 685.86, 726.57, 748.39, 759.68, 758.64, 770.02],
    '宁波市': [440.02, 447.65, 452.31, 463.83, 467.75, 473.6, 484.26, 495.35, 513.27, 529.21, 555.39, 569.45, 589.43, 600.1, 599.02, 607.38],
    '温州市': [513.72, 516.36, 528.14, 536.91, 537.41, 535.46, 535.8, 542.4, 542.59, 542.08, 541.02, 542.46, 545.01, 549.24, 548.05, 555.36]
})
data.set_index('年份', inplace=True)
data.plot(title='2008 - 2023 年杭州、宁波、温州就业人员数变化')
plt.xlabel('年份')
plt.xticks(rotation=45)
plt.ylabel('就业人员数（万人）')
plt.legend()
plt.grid(True)
plt.show()